In [1]:
import pandas as pd
from datetime import datetime, date, timedelta

In [2]:
df1 = pd.read_excel('data/classeur.xlsx')
df1.head(2)

        JOUR  Nb  Jour 2
0 2022-03-14  23   44634
1 2022-03-15  23   44635

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   JOUR    14 non-null     datetime64[ns]
 1   Nb      14 non-null     int64
 2   Jour 2  14 non-null     int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 464.0 bytes

In [4]:
df2 = pd.read_csv(
    'data/classeur.csv', 
    sep=';', 
    parse_dates=['JOUR'], 
    date_parser=lambda dateStr: datetime.strptime(dateStr, '%d/%m/%Y'))
df2.head()

        JOUR  Nb  Jour 2
0 2022-03-14  23   44634
1 2022-03-15  23   44635
2 2022-03-16  23   44636
3 2022-03-17  23   44637
4 2022-03-18  23   44638

In [5]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   JOUR    14 non-null     datetime64[ns]
 1   Nb      14 non-null     int64
 2   Jour 2  14 non-null     int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 464.0 bytes

In [6]:
def strdatefr_to_datetime(strdatefr):
    return datetime.strptime(strdatefr, '%d/%m/%Y')

In [7]:
strdatefr_to_datetime('14/03/2000')

datetime.datetime(2000, 3, 14, 0, 0)

In [8]:
df3 = pd.read_csv(
    'data/classeur.csv', 
    sep=';', 
    parse_dates=['JOUR'], 
    date_parser=strdatefr_to_datetime)
df3.head()

        JOUR  Nb  Jour 2
0 2022-03-14  23   44634
1 2022-03-15  23   44635
2 2022-03-16  23   44636
3 2022-03-17  23   44637
4 2022-03-18  23   44638

In [9]:
dateExcel = 44634
date(1900,1,1) + timedelta(days=dateExcel-2)

datetime.date(2022, 3, 14)

In [10]:
def strdateexcel_to_datetime(strdateexcel):
    intdateexcel = int(strdateexcel)
    return datetime(1900,1,1) + timedelta(days=intdateexcel-2)

In [11]:
strdateexcel_to_datetime('44634')

datetime.datetime(2022, 3, 14, 0, 0)

In [12]:
df4 = pd.read_csv(
    'data/classeur.csv', 
    sep=';', 
    parse_dates=['Jour 2'], 
    date_parser=strdateexcel_to_datetime)
df4.head()

         JOUR  Nb     Jour 2
0  14/03/2022  23 2022-03-14
1  15/03/2022  23 2022-03-15
2  16/03/2022  23 2022-03-16
3  17/03/2022  23 2022-03-17
4  18/03/2022  23 2022-03-18

In [13]:
df3['Jour 2'] = df3['Jour 2'].apply(strdateexcel_to_datetime)
df3.head(3)

        JOUR  Nb     Jour 2
0 2022-03-14  23 2022-03-14
1 2022-03-15  23 2022-03-15
2 2022-03-16  23 2022-03-16